[
  {
    "category": "general",
    "text":
            "There are many different text types a person may encounter in the course of a single day. They might read a newspaper article in the morning, then write a letter (or email) to a friend, follow a recipe to make dinner, complete an application form, pick up a leaflet, before finally savouring a good novel at bedtime. While all of these forms of text have the written word in common, each has its own unique features and conventions."
  },
  {
    "category": "general",
    "text": "No rescue anywhere so we huddle around a fire under the railway bridge. Bennie says he knows where to score free chicken and he scrolls the Poultry Rehoming page. Jeez, there's more than chickens going, there's fat geese, there's ducks, there's swans. All needing “forever” homes. We laugh at Clyde the rooster. The owner's kid has fixed a party hat to his head, aw cute, and the post says this pet is NOT for the pot. We stare at Clyde, strutting around... us feeling a certain kind of hunger and \"forever\" we whisper, who doesn't need a forever home?"
  },
  {
    "category": "general",
    "text": "There was a window when one could grocery shop without a mask. There was a window after my mother stopped chemo when she felt better, gained a few pounds. The color returned to her face. Mom offered to finally share her secret spice cake recipe, and I said, \"Not now, I don’t have a pen,\" but the truth was, I thought writing it down would be bad luck. There was a window of adequate rainfall, climate change seemed fixable. There was a window, after you finally left your wife, when if you had called me, I would still have come."
  },
  {
    "category": "short",
    "text":
            "In a certain village lived a farmer and his only son."
  },
  {
    "category": "general",
    "text":
            "In a certain village lived a farmer and his only son. The son was a thief who goes about stealing from people's homes. He continued this wicked lifestyle till the day his cup got filled. He stole heavy some of money from the richest man in their village, that day he didn't escape successfully as he used to. The farmer involved the police immediately he found out that his money was missing and the police started investigating, and finally they found out that the boy stole the money so they sent him to prison."
  },
  {
    "category": "general",
    "text":
            "The squealing of hogs was enough to make his ears bleed. He'd driven all night... Rigs Full O' Pigs. He liked the sound of that. What he didn't like was the sound of 130 decibels, second only to the sound of a jet engine, bouncing around inside his brain. He needed a cup of coffee. He'd take a break at the next rest stop. Get out and stretch his legs and give his ears a rest. Else he might drive this bitch right off the bridge, pigs and all. Leave em Achin' for Some Bacon. He liked the sound of that"
  }
]